app/views/users/show.html.erb

      <ul>
        <% Node.where(course_id: params[:course_id], father_id: fln.id).each do |cn| %>
---
SELECT  "nodes".* FROM "nodes"  WHERE "nodes"."course_id" = 1 AND "nodes"."father_id" = -1 LIMIT 1