app/controllers/courses_controller.rb

SELECT  "courses".* FROM "courses"  WHERE "courses"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @course = Course.find(params[:id])