app/controllers/nodes_controller.rb

  def create
    @node = Node.new(node_params.merge(course_id: params[:course_id]))
    respond_to do |format|
      if @node.save
---
INSERT INTO "nodes" ("course_id", "created_at", "father_id", "name", "updated_at", "weight") VALUES (?, ?, ?, ?, ?, ?)  [["course_id", 1], ["created_at", "2014-11-04 05:37:32.215409"], ["father_id", -1], ["name", "asdas"], ["updated_at", "2014-11-04 05:37:32.215409"], ["weight", 6]]

  def edit
    @node = Node.find(params[:id])
---
SELECT  "nodes".* FROM "nodes"  WHERE "nodes"."id" = ? LIMIT 1  [["id", 2]]

  def destroy
    @node = Node.find(params[:id])
---
SELECT  "nodes".* FROM "nodes"  WHERE "nodes"."id" = ? LIMIT 1  [["id", 4]]