app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
    @course = Course.find(params[:course_id])
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "courses".* FROM "courses"  WHERE "courses"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("created_at", "name", "nickname", "student_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-11-04 07:24:22.917175"], ["name", "foo"], ["nickname", "oh"], ["student_id", 123445], ["updated_at", "2014-11-04 07:24:22.917175"]]